{
    "args": [
        
    ],
    "provider": "Azure",
    "serviceType": "Subscription Security",
    "serviceName": "Subscription",
    "displayName": "Ensure that Microsoft Defender External Attack Surface Monitoring (EASM) is enabled",
    "description": "\r\n\t\t\t\tAn organization\u0027s attack surface is the collection of assets with a public network identifier or URI that an external threat actor can see or access from outside your cloud. It is the set of points on the boundary of a system, a system element, system component, or an environment where an attacker can try to enter, cause an effect on, or extract data from, that system, system element, system component, or environment. The larger the attack surface, the harder it is to protect. \r\n\t\t\t\tThis tool can be configured to scan your organization\u0027s online infrastructure such as specified domains, hosts, CIDR blocks, and SSL certificates, and store them in an Inventory. Inventory items can be added, reviewed, approved, and removed, and may contain enrichments (`insights`) and additional information collected from the tool\u0027s different scan engines and open-source intelligence sources. \r\n\t\t\t\tA Defender EASM workspace will generate an Inventory of publicly exposed assets by crawling and scanning the internet using Seeds you provide when setting up the tool. Seeds can be FQDNs, IP CIDR blocks, and WHOIS records. \r\n\t\t\t\tDefender EASM will generate Insights within 24-48 hours after Seeds are provided, and these insights include vulnerability data (CVEs), ports and protocols, and weak or expired SSL certificates that could be used by an attacker for reconnaissance or exploitation. \r\n\t\t\t\tResults are classified High/Medium/Low and some of them include proposed mitigations.\r\n  ",
    "rationale": "This tool can monitor the externally exposed resources of an organization, provide valuable insights, and export these findings in a variety of formats (including CSV) for use in vulnerability management operations and red/purple team exercises.",
    "impact": "\r\n\t\tMicrosoft Defender EASM workspaces are currently available as Azure Resources with a 30-day free trial period but can quickly accrue significant charges. The costs are calculated daily as (Number of \"billable\" inventory items) x (item cost per day; approximately: $0.017). \r\n\t\tEstimated cost is not provided within the tool, and users are strongly advised to contact their Microsoft sales representative for pricing and set a calendar reminder for the end of the trial period. \r\n\t\tFor an EASM workspace having an Inventory of 5k-10k billable items (IP addresses, hostnames, SSL certificates, etc) a typical cost might be approximately $85-170 per day or $2500-5000 USD/month at the time of publication. If the workspace is deleted by the last day of a free trial period, no charges are billed. \r\n  ",
    "remediation": {
        "text": "To begin remediation, a Microsoft Defender EASM workspace must be created. The resources and inventory items added to this workspace will depend on your environment. ",
        "code": {
            "powerShell": null,
            "iac": null,
            "terraform": null,
            "other": null
        }
    },
    "recommendation": null,
    "references": [
        "https://learn.microsoft.com/en-us/azure/external-attack-surface-management/",
        "https://learn.microsoft.com/en-us/azure/external-attack-surface-management/deploying-the-defender-easm-azure-resource",
        "https://www.microsoft.com/en-us/security/blog/2022/08/02/microsoft-announces-new-solutions-for-threat-intelligence-and-attack-surface-management/"
    ],
    "compliance": [
        {
            "name": "CIS Microsoft Azure Foundations",
            "version": "3.0.0",
            "reference": "3.1.15",
            "profile": "Level 2"
        }
    ],
    "level": "info",
    "tags": [
        
    ],
    "rule": {
        "path": "",
        "subPath": null,
        "selectCondition": {
            
        },
        "query": [
            
        ],
        "shouldExist": null,
        "returnObject": null,
        "removeIfNotExists": null
    },
    "output": {
        "html": {
            "data": {
                "expandObject": null
            },
            "table": "asList",
            "decorate": [
                
            ],
            "emphasis": [
                
            ],
            "actions": {
                "objectData": {
                    "properties": [
                        
                    ],
                    "expandObject": null,
                    "limit": null
                },
                "showGoToButton": null,
                "showModalButton": null,
                "directLink": null
            }
        },
        "text": {
            "data": {
                "properties": {
                    
                },
                "expandObject": null
            },
            "status": {
                "keyName": [
                    
                ],
                "message": "",
                "defaultMessage": null
            },
            "properties": {
                "resourceName": null,
                "resourceId": null,
                "resourceType": null
            },
            "onlyStatus": false
        }
    },
    "idSuffix": "azure_defender_easm_disabled",
    "notes": [
        
    ],
    "categories": [
        
    ],
    "immutable_properties": [
        
    ],
    "id": "azure_144"
}
