{
    "dashboard_name":  "Active Directory",
    "menu_name":  "Active Directory",
    "issue_name":  "Ensure that password protection is enabled for Active Directory",
    "description":  "Enable Azure Active Directory Password Protection to Active Directory to protect against the use of common passwords.",
    "rationale":  "Azure Active Directory protects an organization by prohibiting the use of weak or leaked passwords. In addition, organizations can create custom banned password lists to prevent their users from using easily guessed passwords that are specific to their industry. Deploying this feature to Active Directory will strengthen the passwords that are used in the environment.",
    "impact":  "The potential impact associated with implementation of this setting is dependent upon the existing password policies in place in the environment. For environments that have strong password policies in place, the impact will be minimal. For organizations that do not have strong password policies in place, implementation of Azure Active Directory Password Protection may require users to change passwords, and adhere to more stringent requirements than they have been accustomed to.",
    "remediation":  null,
    "references":  [
                       "https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-password-ban-bad-on-premises"
                   ],
    "compliance":  [
                       {
                           "name":  "CIS Microsoft 365 Foundations",
                           "version":  "1.4.0",
                           "reference":  "1.1.5"
                       }
   ],
    "tags":  null,
    "path":  "aad_password_policy",
    "display_path":  "aad_password_policy",
    "conditions":  [
                       "or",
                       [
                           "enforceCustomBannedPasswords",
                           "eq",
                           "false"
                       ],
                       [
                           "enableBannedPasswordCheckOnPremises",
                           "eq",
                           "false"
                       ]
                   ],
    "id_suffix":  "aad_password_protection_disabled"
}
