{
    "args": [
        
    ],
    "provider": "Azure",
    "serviceType": "Diagnostic Settings",
    "serviceName": "Subscription",
    "displayName": "Ensure that Azure Monitor Resource Logging is Enabled for All Services that Support it",
    "description": "\r\n\t\tResource Logs capture activity to the data access plane while the Activity log is a subscription-level log for the control plane. Resource-level diagnostic logs provide insight into operations that were performed within that resource itself; for example, reading or updating a secret from a Key Vault. Currently, 95 Azure resources support Azure Monitoring (See the more information section for a complete list), including Network Security Groups, Load Balancers, Key Vault, AD, Logic Apps, and CosmosDB. The content of these logs varies by resource type. \r\n\t\tA number of back-end services were not configured to log and store Resource Logs for certain activities or for a sufficient length. It is crucial that monitoring is correctly configured to log all relevant activities and retain those logs for a sufficient length of time. Given that the mean time to detection in an enterprise is 240 days, a minimum retention period of two years is recommended. \r\n  ",
    "rationale": "A lack of monitoring reduces the visibility into the data plane, and therefore an organization\u0027s ability to detect reconnaissance, authorization attempts or other malicious activity. Unlike Activity Logs, Resource Logs are not enabled by default. Specifically, without monitoring it would be impossible to tell which entities had accessed a data store that was breached. In addition, alerts for failed attempts to access APIs for Web Services or Databases are only possible when logging is enabled.",
    "impact": "Costs for monitoring varies with Log Volume. Not every resource needs to have logging enabled. It is important to determine the security classification of the data being processed by the given resource and adjust the logging based on which events need to be tracked. This is typically determined by governance and compliance requirements.",
    "remediation": {
        "text": "\r\n\t\t\t###### Remediate from Azure Portal \r\n\t\t\tThe specific steps for configuring resources within the Azure console vary depending on resource, but typically the steps are: \r\n\t\t\t1. Go to the resource \r\n\t\t\t2. Click on Diagnostic settings \r\n\t\t\t3. In the blade that appears, click `Add diagnostic setting`\r\n\t\t\t4. Configure the diagnostic settings \r\n\t\t\t5. Click on Save \r\n\t",
        "code": {
            "powerShell": null,
            "iac": null,
            "terraform": null,
            "other": null
        }
    },
    "recommendation": null,
    "references": [
        "https://learn.microsoft.com/en-us/security/benchmark/azure/mcsb-logging-threat-detection#lt-3-enable-logging-for-security-investigation"
    ],
    "compliance": [
        {
            "name": "CIS Microsoft Azure Foundations",
            "version": "3.0.0",
            "reference": "6.4",
            "profile": "Level 1"
        }
    ],
    "level": "medium",
    "tags": [
        
    ],
    "rule": {
        "path": "",
        "subPath": null,
        "selectCondition": {
            
        },
        "query": [
            
        ],
        "shouldExist": null,
        "returnObject": null,
        "removeIfNotExists": null
    },
    "output": {
        "html": {
            "data": {
                "expandObject": null
            },
            "table": "asList",
            "decorate": [
                
            ],
            "emphasis": [
                
            ],
            "actions": {
                "objectData": {
                    "properties": [
                        
                    ],
                    "expandObject": null,
                    "limit": null
                },
                "showGoToButton": null,
                "showModalButton": null,
                "directLink": null
            }
        },
        "text": {
            "data": {
                "properties": {
                    
                },
                "expandObject": null
            },
            "status": {
                "keyName": [
                    
                ],
                "message": "",
                "defaultMessage": null
            },
            "properties": {
                "resourceName": null,
                "resourceId": null,
                "resourceType": null
            },
            "onlyStatus": false
        }
    },
    "idSuffix": "azure_resource_lack_diagnostic_settings",
    "notes": [
        
    ],
    "categories": [
        
    ],
    "immutable_properties": [
        
    ],
    "id": "azure_167"
}
