{   
	"serviceType":  "General",
    "serviceName":  "Microsoft Entra ID",
    "displayName":  "Ensure that password hash sync is enabled for hybrid deployments",
    "description":  "
		Password hash synchronization is one of the sign-in methods used to accomplish hybrid identity synchronization. Microsoft Entra ID Connect synchronizes a hash, of the hash, of a user's password from an on-premises Active Directory instance to a cloud-based Microsoft Entra ID instance.
		
		**Note**: Audit and remediation procedures in this recommendation only apply to Microsoft 365 tenants operating in a hybrid configuration using Microsoft Entra ID Connect sync.
	",
    "rationale":  "
		Password hash synchronization helps by reducing the number of passwords your users need to maintain to just one and enables leaked credential detection for your hybrid accounts. Leaked credential protection is leveraged through Microsoft Entra ID Identity Protection and is a subset of that feature which can help identity if an organization's user account passwords have appeared on the dark web or public spaces.
		
		Using other options for your directory synchronization may be less resislient as Microsoft can still process sign-ins to 365 with Hash Sync even if a network connection to your on-premises environment is not available.
	",
    "impact":  "Compliance or regulatory restrictions may exist, depending on the organization's business sector, that preclude hashed versions of passwords from being securely transmitted to cloud data centers.",
    "remediation":  null,
    "references":  [
		"https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-password-ban-bad-on-premises"
	],
    "compliance":  [
		{
			"name":  "CIS Microsoft 365 Foundations",
			"version":  "1.4.0",
			"reference":  "1.1.7"
		}
	],
	"level": "medium",
    "tags":  null,
    "path":  "aad_connect_info",
	"conditions":  [
		{
			statements: [
				{
					conditions : [
						["ADConnect.dirSyncConfigured","eq","true"],
						["ADConnect.dirSyncEnabled","eq","true"],
						["PasswordSync","ne","true"]
					],
					operator : 'and'
				}
			]
		}
	],
    "idSuffix":  "aad_hash_sync_disabled"
}
