{
  "args": [
    
  ],
  "provider": "EntraID",
  "serviceType": "Conditional Access",
  "serviceName": "Microsoft Entra ID",
  "displayName": "Ensure Trusted Locations Are Defined",
  "description": "Microsoft Entra ID Conditional Access allows an organization to configure `Named locations` and configure whether those locations are trusted or untrusted. These settings provide organizations the means to specify Geographical locations for use in conditional access policies, or define actual IP addresses and IP ranges and whether or not those IP addresses and/or ranges are trusted by the organization.",
  "rationale": "Defining trusted source IP addresses or ranges helps organizations create and enforce Conditional Access policies around those trusted or untrusted IP addresses and ranges. Users authenticating from trusted IP addresses and/or ranges may have less access restrictions or access requirements when compared to users that try to authenticate to Microsoft Entra ID from untrusted locations or untrusted source IP addresses/ranges. ",
  "impact": "
		When configuring `Named locations`, the organization can create locations using geographical location data or by defining source IP addresses or ranges. Configuring `Named locations` using a Country location does not provide the organization the ability to mark those locations as trusted, and any Conditional Access policy relying on those `Countries location` setting will not be able to use the All trusted locations setting within the Conditional Access policy. They instead will have to rely on the `Select locations` setting. This may add additional resource requirements when configuring and will require thorough organizational testing. 
		In general, Conditional Access policies may completely prevent users from authenticating to Microsoft Entra ID, and thorough testing is recommended. To avoid complete lockout, a 'Break Glass' account with full Global Administrator rights is recommended in the event all other administrators are locked out of authenticating to Microsoft Entra ID. This 'Break Glass' account should be excluded from Conditional Access Policies and should be configured with the longest pass phrase feasible in addition to a FIDO2 security key or certificate kept in a very secure physical location. This account should only be used in the event of an emergency and complete administrator lockout.
		*NOTE:* Starting July 2024, Microsoft will begin requiring MFA for All Users - including Break Glass Accounts. By the end of October 2024, this requirement will be enforced. Physical FIDO2 security keys, or a certificate kept on secure removable storage can fulfill this MFA requirement. If opting for a physical device, that device should be kept in a very secure, documented physical location.
  ",
  "remediation": {
    "text": "
		###### Remediate from Azure Portal <br>

		1. In the Azure Portal, navigate to `Microsoft Entra ID` 
		2. Under `Manage`, click `Security` 
		3. Under `Protect`, click `Conditional Access` 
		4. Under `Manage`, click `Named locations` 
		5. Within the `Named locations` blade, click on `IP ranges location` 
		6. Enter a name for this location setting in the `Name` text box 
		7. Click on the `+` sign 
		8. Add an IP Address Range in CIDR notation inside the text box that appears 
		9. Click on the `Add` button 
		10. Repeat steps 7 through 9 for each IP Range that needs to be added 
		11. If the information entered are trusted ranges, select the `Mark as trusted location` check box 
		12. Once finished, click on `Create`
	",
    "code": {
      "powerShell": null,
      "iac": null,
      "terraform": null,
      "other": null
    }
  },
  "recommendation": null,
  "references": [
    "https://learn.microsoft.com/en-us/entra/identity/conditional-access/concept-assignment-network",
    "https://learn.microsoft.com/en-us/security/benchmark/azure/mcsb-identity-management#im-7-restrict-resource-access-based-on--conditions",
    "https://learn.microsoft.com/en-us/entra/identity/role-based-access-control/security-emergency-access"
  ],
  "compliance": [
    {
      "name": "CIS Microsoft Azure Foundations",
      "version": "3.0.0",
      "reference": "2.2.1",
	  "profile": "Level 2"
    }
  ],
  "level": "medium",
  "tags": [
    
  ],
  "rule": {
    "path": "",
    "subPath": null,
    "selectCondition": {
      
    },
    "query": [
    ],
    "shouldExist": "true",
    "returnObject": null,
    "removeIfNotExists": null
  },
  "output": {
    "html": {
      "data": {
      },
      "table": "Normal",
      "decorate": [
        
      ],
      "emphasis": [
        
      ],
      "actions": {
        "objectData": {
          "properties": [
            "*"
          ],
          "expandObject": "",
          "limit": null
        },
        "showGoToButton": "False",
        "showModalButton": "False",
        "directLink": null
      }
    },
    "text": {
      "data": {
        "properties": {
        },
        "expandObject": ""
      },
      "status": {
        "keyName": [
        ],
      "message": "",
      "defaultMessage": "Ensure Trusted Locations Are Defined"
      },
      "properties": {
      },
      "onlyStatus": true
    }
  },
  "idSuffix": "eid_trusted_location_defined",
  "notes": [
    
  ],
  "categories": [
    
  ]
}

