{
    "dashboard_name":  "Storage Accounts",
    "menu_name":  "Storage",
    "issue_name":  "Ensure that 'Enable key rotation reminders' is enabled for each Storage Account",
    "description": 'Access Keys authenticate application access requests to data contained in Storage Accounts. A periodic rotation of these keys is recommended to ensure that potentially compromised keys cannot result in a long-term exploitable credential. The "Rotation Reminder" is an automatic reminder feature for a manual procedure.
	',
    "rationale": "
		Reminders such as those generated by this recommendation will help maintain a regular and healthy cadence for activities which improve the overall efficacy of a security program.Cryptographic key rotation periods will vary depending on your organization's security requirements and the type of data which is being stored in the Storage Account. For example, PCI DSS mandates that cryptographic keys be replaced or rotated `regularly`, and advises that keys for static data stores be rotated every `few months`. For the purposes of this recommendation, 90 days will prescribed for the reminder. Review and adjustment of the 90 day period is recommended, and may even be necessary. Your organization's security requirements should dictate the appropriate setting.
	",
    "impact":  "This recommendation only creates a periodic reminder to regenerate access keys. Regenerating access keys can affect services in Azure as well as the organization's applications that are dependent on the storage account. All clients that use the access key to access the storage account must be updated to use the new key.
	",
    "remediation":  '
					###### From Azure Console
					1. Go to `Storage Accounts`
					2. For each Storage Account that is not compliant, go to `Access keys`
					3. Click `Set rotation reminder`
					4. Check the `Enable key rotation reminders`
					
					In the Send reminders field select Custom, then set the Remind me every: field to `90` and the period drop down menu to Days.
	',
    "references":  [
                       "https://learn.microsoft.com/en-us/azure/storage/common/storage-account-create?tabs=azure-portal#regenerate-storage-access-keys",
					   "https://learn.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-privileged-access#pa-1-protect-and-limit-highly-privileged-users",
					   "https://learn.microsoft.com/en-us/security/benchmark/azure/security-controls-v3-privileged-access#pa-2-restrict-administrative-access-to-business-critical-systems"
                   ],
    "compliance":  [
                       {
                           "name":  "CIS Microsoft Azure Foundations",
                           "version":  "1.5.0",
                           "reference":  "3.3"
                       }
                   ],
    "tags":  null,
    "path":  "az_storage_accounts",
    "display_path":  "az_storage_accounts",
    "conditions":  [
                       "and",
                       [
                           "properties.keyPolicy.keyExpirationPeriodInDays",
                           "eq",
                           ""
                       ]
   ],
    "id_suffix":  "storage_accounts_rotation_reminder_disabled"
}
