{
  "args": [
    
  ],
  "provider": "Microsoft365",
  "serviceType": "Microsoft Teams",
  "serviceName": "Microsoft 365",
  "displayName": "Ensure users can report security concerns in Teams",
  "description": "
		User reporting settings allow a user to report a message as malicious for further analysis. This recommendation is composed of 3 different settings and all be configured to pass:
		* In the Teams admin center: On by default and controls whether users are able to report messages from Teams. When this setting is turned off, users can't report messages within Teams, so the corresponding setting in the Microsoft 365 Defender portal is irrelevant. 
		* In the Microsoft 365 Defender portal: On by default for new tenants. Existing tenants need to enable it. If user reporting of messages is turned on in the Teams admin center, it also needs to be turned on the Defender portal for user reported messages to show up correctly on the User reported tab on the Submissions page. 
		* Defender - Report message destinations: This applies to more than just Microsoft Teams and allows for an organization to keep their reports contained. Due to how the parameters are configured on the backend it is included in this assessment as a requirement. 
  ",
  "rationale": "Users will be able to more quickly and systematically alert administrators of suspicious malicious messages within Teams. The content of these messages may be sensitive in nature and therefore should be kept within the organization and not shared with Microsoft without first consulting company policy.",
  "impact": "Enabling message reporting has an impact beyond just addressing security concerns. When users of the platform report a message, the content could include messages that are threatening or harassing in nature, possibly stemming from colleagues. Due to this the security staff responsible for reviewing and acting on these reports should be equipped with the skills to discern and appropriately direct such messages to the relevant departments, such as Human Resources (HR).",
  "remediation": {
    "text": "
			###### To remediate using the UI: 
			1. Navigate to Microsoft Teams admin center https://admin.teams.microsoft.com. 
			2. Click to expand Messaging select Messaging policies. 
			3. Click Global (Org-wide default). 
			4. Set Report a security concern to On. 
			5. Next, navigate to Microsoft 365 Defender https://security.microsoft.com/ 
			6. Click on Settings > Email & collaboration > User reported settings. 
			7. Scroll to Microsoft Teams. 
			8. Check Monitor reported messages in Microsoft Teams and Save. 
			9. Set Send reported messages to: to My reporting mailbox only with reports configured to be sent to authorized staff. 
	",
    "code": {
      "powerShell": null,
      "iac": null,
      "terraform": null,
      "other": null
    }
  },
  "recommendation": null,
  "references": [
    "https://learn.microsoft.com/en-us/defender-office-365/submissions-teams?view=o365-worldwide"
  ],
  "compliance": [
    {
      "name": "CIS Microsoft 365 Foundations Benchmark",
      "version": "3.1.0",
      "reference": "8.6.1",
	  "profile": "E3 Level 1"
    }
  ],
  "level": "medium",
  "tags": [
    
  ],
  "rule": {
    "path": "",
    "subPath": null,
    "selectCondition": {
      
    },
    "query": [
    ],
    "shouldExist": null,
    "returnObject": null,
    "removeIfNotExists": null
  },
  "output": {
    "html": {
      "data": {
        "expandObject": null
      },
      "table": "Normal",
      "decorate": [
        
      ],
      "emphasis": [
        
      ],
      "actions": {
        "objectData": {
          "properties": [
            "*"
          ],
          "expandObject": null,
          "limit": null
        },
        "showGoToButton": "True",
        "showModalButton": "True",
        "directLink": null
      }
    },
    "text": {
      "data": {
        "properties": {
          
        },
        "expandObject": null
      },
      "status": {
        "keyName": [
          
        ],
        "message": "Ensure users can report security concerns in Teams",
        "defaultMessage": null
      },
      "properties": {
        "resourceName": null,
        "resourceId": null,
        "resourceType": null
      },
      "onlyStatus": false
    }
  },
  "idSuffix": "teams_users_report_security_concerns_not_configured",
  "notes": [
    
  ],
  "categories": [
    
  ]
}

