{
  "args": [],
  "provider": "Microsoft365",
  "serviceType": "EntraID",
  "serviceName": "Microsoft 365",
  "displayName": "Ensure multifactor authentication is enabled for all users",
  "description": "Enable multifactor authentication for all users in the Microsoft 365 tenant. Users will be prompted to authenticate with a second factor upon logging in to Microsoft 365 services. The second factor is most commonly a text message to a registered mobile phone number where they type in an authorization code, or with a mobile application like Microsoft Authenticator.",
  "rationale": "Multifactor authentication requires an individual to present a minimum of two separate forms of authentication before access is granted. Multifactor authentication provides additional assurance that the individual attempting to gain access is who they claim to be. With multifactor authentication, an attacker would need to compromise at least two different authentication mechanisms, increasing the difficulty of compromise and thus reducing the risk.",
  "impact": "Implementation of multifactor authentication for all users will necessitate a change to user routine. All users will be required to enroll in multifactor authentication using phone, SMS, or an authentication application. After enrollment, use of multifactor authentication will be required for future authentication to the environment.\n\nExternal identities that attempt to access documents that utilize Purview Information Protection (Sensitivity Labels) will find their access disrupted. In order to mitigate this create an exclusion for Microsoft Rights Management Services ID: 00000012-0000-0000-c000-000000000000\n\nNote: Organizations that struggle to enforce MFA globally due to budget constraints preventing the provision of company-owned mobile devices to every user, or due to regulations, unions, or policies that prevent forcing end users to use their personal devices, have another option. FIDO2 security keys can be used as an alternative. They are more secure, phishing-resistant, and affordable for organizations to issue to every end user.",
  "remediation": {
    "text": "To remediate using the UI:\n1. Navigate to the Microsoft Entra admin center https://entra.microsoft.com.\n2. Click expand Protection > Conditional Access select Policies.\n3. Click New policy.\n    *   Under Users include All users.\n    *   Under Target resources include All resources (formerly 'All cloud apps') and do not create any exclusions.\n    *   Under Grant select Grant Access and check either Require multifactor authentication or Require authentication strength.\n    *   Click Select at the bottom of the pane.\n4. Under Enable policy set it to Report-only until the organization is ready to enable it.\n5. Click Create.\n\nNote: Break-glass accounts should be excluded from all Conditional Access policies.",
    "code": {
      "powerShell": null,
      "iac": null,
      "terraform": null,
      "other": null
    }
  },
  "recommendation": null,
  "references": [
    "https://learn.microsoft.com/en-us/entra/identity/conditional-access/howtoconditional-access-policy-all-users-mfa"
  ],
  "compliance": [
    {
      "name": "CIS Microsoft 365 Foundations",
      "version": "5.0.0",
      "reference": "3.1.2"
    }
  ],
  "level": "medium",
  "tags": [
    "CIS Microsoft 365 Foundations 5.0.0 3.1.2",
    "EntraID",
    "Conditional Access"
  ],
  "rule": {
    "path": "Get-MonkeyAADConditionalAccess",
    "subPath": null,
    "selectCondition": "[?grantControls._operator -eq 'OR' -and grantControls.builtInControls -contains 'mfa']",
    "query": [],
    "shouldExist": false, 
    "returnObject": null,
    "removeIfNotExists": null
  },
  "output": {
    "html": {
      "data": {
        "properties": {
          "displayName": "Policy Name",
          "state": "State",
          "grantControlsBuiltInControls": "Grant Controls",
          "usersIncludeUsers": "Included Users"
        },
        "expandObject": null
      },
      "table": "Normal",
      "decorate": [
        {
          "ItemName": "State",
          "ItemValue": "enabledForReportingButNotEnforced",
          "className": "badge bg-warning larger-badge"
        },
        {
          "ItemName": "State",
          "ItemValue": "disabled",
          "className": "badge bg-danger larger-badge"
        }
      ],
      "emphasis": [],
      "actions": {
        "objectData": {
          "properties": ["*"],
          "expandObject": null,
          "limit": null
        },
        "showGoToButton": "True",
        "showModalButton": "True",
        "directLink": null
      }
    },
    "text": {
      "data": {
        "properties": {},
        "expandObject": null
      },
      "status": {
        "keyName": [],
        "message": "A Conditional Access Policy requiring MFA for all users is missing or not correctly configured.",
        "defaultMessage": null
      },
      "properties": {
        "resourceName": "displayName",
        "resourceId": "id",
        "resourceType": "Microsoft.Graph.ConditionalAccessPolicy"
      },
      "onlyStatus": false 
    }
  },
  "idSuffix": "eid-ensure-mfa-for-users-missing-cap",
  "notes": ["This control is similar to 5.2.2.2. The rule logic implies we are looking for the ABSENCE of such a policy, hence `shouldExist: false`."],
  "categories": []
}