{
  "args": [],
  "provider": "Microsoft365",
  "serviceType": "EntraID",
  "serviceName": "Microsoft 365",
  "displayName": "Enable Conditional Access policies to block legacy authentication",
  "description": "Entra ID supports the most widely used authentication and authorization protocols including legacy authentication. This authentication pattern includes basic authentication, a widely used industry-standard method for collecting username and password information.\n\nThe following messaging protocols support legacy authentication:\n\n*   Authenticated SMTP - Used to send authenticated email messages.\n*   Autodiscover - Used by Outlook and EAS clients to find and connect to mailboxes in Exchange Online.\n*   Exchange ActiveSync (EAS) - Used to connect to mailboxes in Exchange Online.\n*   Exchange Online PowerShell - Used to connect to Exchange Online with remote PowerShell. If you block Basic authentication for Exchange Online PowerShell, you need to use the Exchange Online PowerShell Module to connect. For instructions, see Connect to Exchange Online PowerShell using multifactor authentication.\n*   Exchange Web Services (EWS) - A programming interface that's used by Outlook, Outlook for Mac, and third-party apps.\n*   IMAP4 - Used by IMAP email clients.\n*   MAPI over HTTP (MAPI/HTTP) - Primary mailbox access protocol used by Outlook 2010 SP2 and later.\n*   Offline Address Book (OAB) - A copy of address list collections that are downloaded and used by Outlook.\n*   Outlook Anywhere (RPC over HTTP) - Legacy mailbox access protocol supported by all current Outlook versions.\n*   POP3 - Used by POP email clients.\n*   Reporting Web Services - Used to retrieve report data in Exchange Online.\n*   Universal Outlook - Used by the Mail and Calendar app for Windows 10.\n*   Other clients - Other protocols identified as utilizing legacy authentication.",
  "rationale": "Legacy authentication protocols do not support multi-factor authentication. These protocols are often used by attackers because of this deficiency. Blocking legacy authentication makes it harder for attackers to gain access.\n\nNote: Basic authentication is now disabled in all tenants. Before December 31 2022, you could re-enable the affected protocols if users and apps in your tenant couldn't connect. Now no one (you or Microsoft support) can re-enable Basic authentication in your tenant.",
  "impact": "Enabling this setting will prevent users from connecting with older versions of Office, ActiveSync or using protocols like IMAP, POP or SMTP and may require upgrades to older versions of Office, and use of mobile mail clients that support modern authentication.\n\nThis will also cause multifunction devices such as printers from using scan to e-mail function if they are using a legacy authentication method. Microsoft has mail flow best practices in the link below which can be used to configure a MFP to work with modern authentication:\nhttps://learn.microsoft.com/en-us/exchange/mail-flow-best-practices/how-to-set-up-amultifunction-device-or-application-to-send-email-using-microsoft-365-or-office-365",
  "remediation": {
    "text": "To remediate using the UI:\n1. Navigate to the Microsoft Entra admin center https://entra.microsoft.com.\n2. Click expand Protection > Conditional Access select Policies.\n3. Create a new policy by selecting New policy.\n    *   Under Users include All users.\n    *   Under Target resources include All resources (formerly 'All cloud apps').\n    *   Under Conditions select Client apps and check the boxes for Exchange ActiveSync clients and Other clients.\n    *   Under Grant select Block Access.\n    *   Click Select.\n4. Set the policy On and click Create.\n\nNote: Break-glass accounts should be excluded from all Conditional Access policies.",
    "code": {
      "powerShell": null,
      "iac": null,
      "terraform": null,
      "other": null
    }
  },
  "recommendation": null,
  "references": [
    "https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchangeonline/disable-basic-authentication-in-exchange-online",
    "https://learn.microsoft.com/en-us/exchange/mail-flow-best-practices/how-to-setup-a-multifunction-device-or-application-to-send-email-using-microsoft-365-oroffice-365",
    "https://learn.microsoft.com/en-us/exchange/clients-and-mobile-in-exchangeonline/deprecation-of-basic-authentication-exchange-online"
  ],
  "compliance": [
    {
      "name": "CIS Microsoft 365 Foundations",
      "version": "5.0.0",
      "reference": "2.1.1"
    }
  ],
  "level": "high",
  "tags": [
    "CIS Microsoft 365 Foundations 5.0.0 2.1.1",
    "EntraID",
    "Conditional Access"
  ],
  "rule": {
    "path": "Get-MonkeyAADConditionalAccess",
    "subPath": null,
    "selectCondition": "[?state -ne 'enabled' -and conditions.clientAppTypes -contains 'other']",
    "query": [],
    "shouldExist": null,
    "returnObject": null,
    "removeIfNotExists": null
  },
  "output": {
    "html": {
      "data": {
        "properties": {
          "displayName": "Policy Name",
          "state": "State",
          "clientAppTypes": "Client App Types"
        },
        "expandObject": "conditions"
      },
      "table": "Normal",
      "decorate": [
        {
          "ItemName": "State",
          "ItemValue": "enabledForReportingButNotEnforced",
          "className": "badge bg-warning larger-badge"
        },
        {
          "ItemName": "State",
          "ItemValue": "disabled",
          "className": "badge bg-danger larger-badge"
        }
      ],
      "emphasis": [],
      "actions": {
        "objectData": {
          "properties": ["*"],
          "expandObject": null,
          "limit": null
        },
        "showGoToButton": "True",
        "showModalButton": "True",
        "directLink": null
      }
    },
    "text": {
      "data": {
        "properties": {},
        "expandObject": null
      },
      "status": {
        "keyName": [],
        "message": "Conditional Access policies to block legacy authentication are not enabled or correctly configured.",
        "defaultMessage": null
      },
      "properties": {
        "resourceName": "displayName",
        "resourceId": "id",
        "resourceType": "Microsoft.Graph.ConditionalAccessPolicy"
      },
      "onlyStatus": false
    }
  },
  "idSuffix": "eid-cap-block-legacy-authentication-not-enabled",
  "notes": [],
  "categories": []
}