{
    "dashboard_name":  "Identity Protection",
    "menu_name":  "Azure AD",
    "issue_name":  "Ensure that Office 365 Passwords Are Not Set to Expire",
    "description":  "Review the password expiration policy, to ensure that user passwords in Office 365 are not set to expire.",
    "rationale":  "NIST has updated their password policy recommendations to not arbitrarily require users to change their passwords after a specific amount of time, unless there is evidence that the password is compromised or the user forgot it. They suggest this even for single factor (Password Only) use cases, with a reasoning that forcing arbitrary password changes on users actually make the passwords less secure. Other recommendations within this Benchmark suggest the use of MFA authentication for at least critical accounts (at minimum), which makes password expiration even less useful as well as password protection for Azure AD.",
    "impact":  "The primary impact associated with this change is ensuring that users understand the process for making or requesting a password change when required.",
    "remediation":  "
					###### To set Office 365 Passwords to Expire, use the Microsoft 365 Admin Center
					1. Expand `Settings` then select the `Org Settings` subcategory.
					2. Click on `Security & privacy`.
					3. Select `Password expiration policy`.
					4. If the `Set user passwords to expire after a number of days box` is checked, uncheck it.
					5. Click `Save`.
	",
    "references":  [
                       "https://docs.microsoft.com/en-us/microsoft-365/admin/misc/password-policy-recommendations?view=o365-worldwide"
                   ],
    "compliance":  [
                       {
                           "name":  "CIS Microsoft 365 Foundations",
                           "version":  "1.4.0",
                           "reference":  "1.5"
                       }
                   ],
    "tags":  null,
    "path":  "aad_domains",
    "display_path":  "aad_domains",
    "conditions":  [
                       "and",
                       [
                           "passwordValidityPeriodInDays",
                           "ne",
                           "2147483647"
                       ]
	],
    "id_suffix":  "aad_password_expiring_enabled"
}
