{
    "dashboard_name":  "SQL Server",
    "menu_name":  "Databases",
    "issue_name":  "Ensure SQL server's TDE protector is encrypted with Customer-managed key",
    "description":  "
					TDE with Customer-managed key support provides increased transparency and control over the TDE Protector, increased security with an HSM-backed external service, and promotion of separation of duties.
					
					With TDE, data is encrypted at rest with a symmetric key (called the database encryption key) stored in the database or data warehouse distribution. To protect this data encryption key (DEK) in the past, only a certificate that the Azure SQL Service managed could be used. Now, with Customer-managed key support for TDE, the DEK can be protected with an asymmetric key that is stored in the Key Vault. Key Vault is a highly available and scalable cloud-based key store which offers central key management, leverages FIPS 140-2 Level 2 validated hardware security modules (HSMs), and allows separation of management of keys and data, for additional security.
					
					Based on business needs or criticality of data/databases hosted a SQL server, it is recommended that the TDE protector is encrypted by a key that is managed by the data owner (Customer-managed key).
	",
    "rationale":  "Customer-managed key support for Transparent Data Encryption (TDE) allows user control of TDE encryption keys and restricts who can access them and when. Azure Key Vault, Azure’s cloud-based external key management system is the first key management service where TDE has integrated support for Customer-managed keys. With Customer-managed key support, the database encryption key is protected by an asymmetric key stored in the Key Vault. The asymmetric key is set at the server level and inherited by all databases under that server.",
    "impact":  "
				   Once TDE protector is encrypted with a Customer-managed key, it transfers entire responsibility of respective key management on to you and hence you should be more careful about doing any operations on the particular key in order to keep data from corresponding SQL server and Databases hosted accessible.
				   
				   When deploying Customer Managed Keys it is also prudent to ensure that you also deploy an automated toolset for managing these keys (this should include discovery and key rotation), and Keys should be stored in an HSM or hardware backed keystore E.G. Azure Keyvault).
				   
				   As far as toolsets go, check with your cryptographic key provider as they may well provide one as an add on to their service.
	",
    "remediation":  null,
    "references":  [
                       "https://docs.microsoft.com/en-us/azure/azure-sql/database/transparent-data-encryption-byok-overview?view=azuresql"
                   ],
    "compliance":  [
                       {
                           "name":  "CIS Microsoft Azure Foundations",
                           "version":  "1.4.0",
                           "reference":  "4.6"
                       }
                   ],
    "tags":  null,
    "path":  "az_sql_servers",
    "display_path":  "az_sql_servers",
    "conditions":  [
                       "and",
                       [
                           "TDEProtectorMode",
                           "eq",
                           "servicemanaged"
                       ],
                       [
                           "TDEProtectorServerkeyName",
                           "eq",
                           "servicemanaged"
                       ],
                       [
                           "TDEProtectorServerkeyType",
                           "eq",
                           "servicemanaged"
                       ],
                       [
                           "TDEProtectorUri",
                           "eq",
                           ""
                       ]
                   ],
    "id_suffix":  "sql_server_tdp_own_key_disabled"
}
