{
  "args": [
    
  ],
  "provider": "Azure",
  "serviceType": "Azure Virtual Machines",
  "serviceName": "Compute",
  "displayName": "Ensure only MFA enabled identities can access privileged Virtual Machine",
  "description": "Verify identities without MFA that can log in to a privileged virtual machine using separate login credentials. An adversary can leverage the access to move laterally and perform actions with the virtual machine's managed identity. Make sure the virtual machine only has necessary permissions, and revoke the admin-level permissions according to the least privileges principal.",
  "rationale": "
		Integrating multi-factor authentication (MFA) as part of the organizational policy can greatly reduce the risk of an identity gaining control of valid credentials that may be used for additional tactics such as initial access, lateral movement, and collecting information. MFA can also be used to restrict access to cloud resources and APIs. 
		An Adversary may log into accessible cloud services within a compromised environment using Valid Accounts that are synchronized to move laterally and perform actions with the virtual machine's managed identity. The adversary may then perform management actions or access cloud-hosted resources as the logged-on managed identity. 
  ",
  "impact": "
		This recommendation requires the Entra ID P2 license to implement. 

		Ensure that identities that are provisioned to a virtual machine utilizes an RBAC/ABAC group and is allocated a role using Azure PIM, and the Role settings require MFA or use another third-party PAM solution for accessing Virtual Machines. 
  ",
  "remediation": {
    "text": null,
    "code": {
      "powerShell": null,
      "iac": null,
      "terraform": null,
      "other": null
    }
  },
  "recommendation": null,
  "references": [
  ],
  "compliance": [
    {
      "name": "CIS Microsoft Azure Foundations",
      "version": "3.0.0",
      "reference": "8.10",
	  "profile": "Level 2"
    }
  ],
  "level": "medium",
  "tags": [
	"Legacy"
  ],
  "rule": {
    "path": "",
    "subPath": null,
    "selectCondition": {
      
    },
    "query": [
    ],
    "shouldExist": null,
    "returnObject": null,
    "removeIfNotExists": null
  },
  "output": {
    "html": {
      "data": {
        "expandObject": null
      },
      "table": "Normal",
      "decorate": [
        
      ],
      "emphasis": [
        
      ],
      "actions": {
        "objectData": {
          "expandObject": null,
          "limit": null
        },
        "showGoToButton": "True",
        "showModalButton": "True",
        "directLink": null
      }
    },
    "text": {
      "data": {
        "properties": {
          
        },
        "expandObject": null
      },
      "status": {
        "keyName": [
          
        ],
        "message": "",
        "defaultMessage": null
      },
      "properties": {
        "resourceName": null,
        "resourceId": null,
        "resourceType": null
      },
      "onlyStatus": false
    }
  },
  "idSuffix": "azure_identities_accessing_vm_lacking_mfa",
  "notes": [
    
  ],
  "categories": [
    
  ]
}

