{
    "dashboard_name": "Users",
    "menu_name": "Azure AD",
    "issue_name": "Do not add guest users if not needed",
    "description": "Azure AD is extended to include Azure AD B2B collaboration, allowing you to invite people from outside your organization to be guest users in your cloud account and sign in with their own work, school, or social identities. Guest users allow you to share your company's applications and services with users from any other organization, while maintaining control over your own corporate data.
					
					Work with external partners, large or small, even if they don't have Azure AD or an IT department. A simple invitation and redemption process lets partners use their own credentials to access your company's resources a a guest user.
	",
    "rationale": "
					Guest users in the Azure AD are generally required for collaboration purposes in Office 365, and may also be required for Azure functions in enterprises with multiple Azure tenants, Guest users should be reviewed on a regular basis, at least annually, Guest users should not be granted administrative roles where possible.
					
					Guest users are typically added outside your employee on-boarding/off-boarding process and could potentially be overlooked indefinitely leading to a potential vulnerability.
					
					Guest users should be review on a monthly basis to ensure that inactive and unneeded accounts are removed.
	",
    "impact": "Consider to remove guest users if not needed. By default, all users and guests in an Azure directory can enumerate users, groups, or other directory resources even if they\u0027re not assigned to an administrator role.",
    "remediation": '
						###### From Azure Console
						1. Go to `Azure Active Directory`
						2. Go to `Users and groups`
						3. Go to `All Users`
						4. Click on `Show` drop down and select `Guest users only`
						5. Delete all "Guest" users that are no longer required or are inactive.
						
						It is good practice to use a dynamic group to manage guest users. To create the dynamic group:
						
						1. Navigate to the `Active Directory` blade in the Azure Portal
						2. Select the `Groups` item
						3. Create new
						4. Type of `dynamic`
						5. Use the following dynamic selection rule. "(user.userType -eq "Guest")"
						6. Once the group has been created, select access reviews option and create a new access review with a period of monthly and send to relevant administrators for review.
	',
    "references":  [
                       "https://docs.microsoft.com/en-us/azure/active-directory/b2b/user-properties",
					   "https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/add-users-azure-active-directory#delete-a-user",
					   "https://docs.microsoft.com/en-us/azure/security/benchmarks/security-controls-v2-privileged-access#pa-3-review-and-reconcile-user-access-regularly"
                   ],
    "compliance":  [
                       {
                           "name":  "CIS Microsoft Azure Foundations",
                           "version":  "1.3.1",
                           "reference":  "1.3"
                       }
                   ],
    "tags": null,
    "path": "aad_domain_users",
    "display_path": "aad_domain_users",
    "conditions":  [
                       "and",
                       [
                           "usertype",
                           "eq",
                           "Guest"
                       ]
                   ],
    "id_suffix": "aad_guest_users_present"
}
